In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
my_data =(10,20,30)
arr = np.array(my_data)

In [3]:
arr

array([10, 20, 30])

In [4]:
d ={'a':10,'b':20,'c':30}

In [5]:
pd.Series(data=arr,index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
d

{'a': 10, 'b': 20, 'c': 30}

In [7]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [8]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [9]:
ser1= pd.Series([1,2,3,5],['USA','Germany','Italy','Japan'])

In [10]:
ser1

USA        1
Germany    2
Italy      3
Japan      5
dtype: int64

In [11]:
ser3 = pd.Series(data=labels)

In [12]:
ser3 + ser1

0          NaN
1          NaN
2          NaN
Germany    NaN
Italy      NaN
Japan      NaN
USA        NaN
dtype: object

In [13]:
ser1 + ser3 +ser1

0          NaN
1          NaN
2          NaN
Germany    NaN
Italy      NaN
Japan      NaN
USA        NaN
dtype: object

# Gets same random numbers everytime

In [14]:
from numpy.random import randn

In [15]:
np.random.seed(101)

In [16]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['L','M','N','O'])

In [17]:
df

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
pd.Series(data=[1],index=['a'])

a    1
dtype: int64

In [19]:
df[['L','M']]

          L         M
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [20]:
df['L']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: L, dtype: float64

In [21]:
df['new_col'] = df['L']+df['M']

In [22]:
df['new_col']

A    3.334983
B    0.331800
C   -1.278046
D   -0.570177
E    2.169552
Name: new_col, dtype: float64

In [23]:
df

          L         M         N         O   new_col
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [24]:
df.drop('new_col', axis = 1)

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df

          L         M         N         O   new_col
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [26]:
df.drop('new_col', axis = 1, inplace = True)

In [27]:
df

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df.drop('E', inplace = True)

In [29]:
df

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [30]:
df.shape

(4, 4)

In [31]:
#rows

In [32]:
df

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [33]:
df.loc['A'] 
#takes row name

L    2.706850
M    0.628133
N    0.907969
O    0.503826
Name: A, dtype: float64

In [34]:
df.iloc[1]
#takes index

L    0.651118
M   -0.319318
N   -0.848077
O    0.605965
Name: B, dtype: float64

In [35]:
df.loc['B','O']

0.6059653494949336

In [36]:
df.loc[['A','C'],['N','O']]

          N         O
A  0.907969  0.503826
C  0.528813 -0.589001

In [37]:
df.iloc[[1,0],[0,3]]

          L         O
B  0.651118  0.605965
A  2.706850  0.503826

In [38]:
df

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [39]:
bool_df = df > 1

In [40]:
bool_df

       L      M      N      O
A   True  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False

In [41]:
df

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [42]:
df['P'] = df['L'] + df['N']

In [43]:
df

          L         M         N         O         P
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [44]:
df.loc['E'] = df.loc['A'] * df.loc['B']

In [45]:
df

          L         M         N         O         P
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  1.762479 -0.200574 -0.770028  0.305301 -0.711971

In [46]:
df.drop('P',axis=1,inplace = True)

In [47]:
df

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  1.762479 -0.200574 -0.770028  0.305301

In [48]:
df['L'] > 0

A     True
B     True
C    False
D     True
E     True
Name: L, dtype: bool

In [49]:
df[df['O']<0]

          L         M         N         O
C -2.018168  0.740122  0.528813 -0.589001

In [50]:
df.loc['E'] > 0 #for row

L     True
M    False
N    False
O     True
Name: E, dtype: bool

In [51]:
df[df['L']>0]

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  1.762479 -0.200574 -0.770028  0.305301

In [52]:
result = df[df['L']>0]

In [53]:
result

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  1.762479 -0.200574 -0.770028  0.305301

In [54]:
result.loc['A']

L    2.706850
M    0.628133
N    0.907969
O    0.503826
Name: A, dtype: float64

In [55]:
result['O']

A    0.503826
B    0.605965
D    0.955057
E    0.305301
Name: O, dtype: float64

In [56]:
df[df['L']>0]['O']

A    0.503826
B    0.605965
D    0.955057
E    0.305301
Name: O, dtype: float64

In [57]:
df[df['L']>0]['O']

A    0.503826
B    0.605965
D    0.955057
E    0.305301
Name: O, dtype: float64

In [58]:
df[df['L']>0]['O']

A    0.503826
B    0.605965
D    0.955057
E    0.305301
Name: O, dtype: float64

In [59]:
df[df['L']>0]

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  1.762479 -0.200574 -0.770028  0.305301

In [60]:
df[df['L']>0][['M','N']]

          M         N
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E -0.200574 -0.770028

In [61]:
df['L']>0

A     True
B     True
C    False
D     True
E     True
Name: L, dtype: bool

In [62]:
result = df['L']>0

In [63]:
result

A     True
B     True
C    False
D     True
E     True
Name: L, dtype: bool

In [64]:
val = df[result]

In [65]:
val

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  1.762479 -0.200574 -0.770028  0.305301

In [66]:
col = ['M','N']

In [67]:
val[col]

          M         N
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E -0.200574 -0.770028

In [68]:
val[['M','N']]

          M         N
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E -0.200574 -0.770028

In [69]:
#the above code can be written in a single line
df[df['L']>0][['M','N']]

          M         N
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E -0.200574 -0.770028

In [70]:
df[(df['L'] > 0) & (df['N'] < 0)]

          L         M         N         O
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  1.762479 -0.200574 -0.770028  0.305301

In [71]:
df[(df['L'] > 0) | (df['N'] < 0)]

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  1.762479 -0.200574 -0.770028  0.305301

In [72]:
(df['L'] > 0) & (df['N'] < 0)

A    False
B     True
C    False
D     True
E     True
dtype: bool

In [73]:
(df['L'] > 0) | (df['N'] < 0)

A     True
B     True
C    False
D     True
E     True
dtype: bool

In [74]:
df.reset_index()

  index         L         M         N         O
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  1.762479 -0.200574 -0.770028  0.305301

In [75]:
df

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  1.762479 -0.200574 -0.770028  0.305301

In [76]:
df.reset_index(inplace = True)

In [77]:
df

  index         L         M         N         O
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  1.762479 -0.200574 -0.770028  0.305301

In [78]:
df['index']

0    A
1    B
2    C
3    D
4    E
Name: index, dtype: object

In [79]:
newwind = 'CA NY WY OR CO'.split(" ")

In [80]:
newwind

['CA', 'NY', 'WY', 'OR', 'CO']

In [81]:
df['States']=newwind

In [82]:
df

  index         L         M         N         O States
0     A  2.706850  0.628133  0.907969  0.503826     CA
1     B  0.651118 -0.319318 -0.848077  0.605965     NY
2     C -2.018168  0.740122  0.528813 -0.589001     WY
3     D  0.188695 -0.758872 -0.933237  0.955057     OR
4     E  1.762479 -0.200574 -0.770028  0.305301     CO

In [83]:
df['States']

0    CA
1    NY
2    WY
3    OR
4    CO
Name: States, dtype: object

In [84]:
df.set_index(['L'])

          index         M         N         O States
L
 2.706850     A  0.628133  0.907969  0.503826     CA
 0.651118     B -0.319318 -0.848077  0.605965     NY
-2.018168     C  0.740122  0.528813 -0.589001     WY
 0.188695     D -0.758872 -0.933237  0.955057     OR
 1.762479     E -0.200574 -0.770028  0.305301     CO

In [85]:
df.set_index(['States'])

       index         L         M         N         O
States
CA         A  2.706850  0.628133  0.907969  0.503826
NY         B  0.651118 -0.319318 -0.848077  0.605965
WY         C -2.018168  0.740122  0.528813 -0.589001
OR         D  0.188695 -0.758872 -0.933237  0.955057
CO         E  1.762479 -0.200574 -0.770028  0.305301

In [86]:
outside = ['G1','G1','G1','G2','G2','G2']
inside =[1,2,3,1,2,3]

In [87]:
higher_index =list(zip(outside,inside))
higher_index= pd.MultiIndex.from_tuples(higher_index)

In [88]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [89]:
inside

[1, 2, 3, 1, 2, 3]

In [90]:
higher_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [91]:
df = pd.DataFrame(np.random.rand(6,2),higher_index,['A','B'])

In [92]:
df

             A         B
G1 1  0.734819  0.541962
   2  0.913154  0.807920
   3  0.402998  0.357224
G2 1  0.952877  0.343632
   2  0.865100  0.830278
   3  0.538161  0.922469

In [93]:
df.loc['G1']

          A         B
1  0.734819  0.541962
2  0.913154  0.807920
3  0.402998  0.357224

In [94]:
df.loc['G1']['A']

1    0.734819
2    0.913154
3    0.402998
Name: A, dtype: float64

In [95]:
df.loc['G2'].iloc[1]

A    0.865100
B    0.830278
Name: 2, dtype: float64

In [96]:
df.index.names = ['Groups','Num']

In [97]:
df

                   A         B
Groups Num
G1     1    0.734819  0.541962
       2    0.913154  0.807920
       3    0.402998  0.357224
G2     1    0.952877  0.343632
       2    0.865100  0.830278
       3    0.538161  0.922469

In [98]:
df.loc['G2'].loc[2]['B']

0.830277712198797

In [99]:
df.loc['G1'].loc[1]

A    0.734819
B    0.541962
Name: 1, dtype: float64

In [100]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.734819  0.541962
G2      0.952877  0.343632

In [101]:
df={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [102]:
df=pd.DataFrame(df)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [103]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [104]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [105]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [106]:
df.dropna(axis=1,thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [107]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [108]:
df.fillna(1)

     A    B  C
0  1.0  5.0  1
1  2.0  1.0  2
2  1.0  1.0  3

In [109]:
df.fillna(df['A'].max())

     A    B  C
0  1.0  5.0  1
1  2.0  2.0  2
2  2.0  2.0  3

In [110]:
data = {
    'Company': ['GOOG','GOOG','MSFT','MSFT','FB','FB'],
    'Person': ['Sam','Charlie','Amy','Vasnessa','Carl','Sarah'],
    'Sales': [200, 120, 340, 124, 243, 350]
}

In [111]:
df=pd.DataFrame(data)

In [112]:
df

  Company    Person  Sales
0    GOOG       Sam    200
1    GOOG   Charlie    120
2    MSFT       Amy    340
3    MSFT  Vasnessa    124
4      FB      Carl    243
5      FB     Sarah    350

In [113]:
byComp = df.groupby('Company')

In [114]:
sumnum=byComp.sum()

In [115]:
sumnum

              Person  Sales
Company
FB         CarlSarah    593
GOOG      SamCharlie    320
MSFT     AmyVasnessa    464

In [116]:
sumnum.loc['FB']

Person    CarlSarah
Sales           593
Name: FB, dtype: object

In [117]:
byComp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [118]:
byComp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [119]:
byComp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [120]:
import pandas as pd 
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [121]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [122]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [123]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [124]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [125]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [126]:
dfnew = pd.concat([df1,df2,df3],axis=1)

In [127]:
dfnew.fillna()

ValueError: Must specify a fill 'value' or 'method'.

In [ ]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
left

In [ ]:
right

In [ ]:
pd.merge(left,right,how='inner',on=['key'])

## Pandas-Operation

In [ ]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']
})

In [ ]:
df

In [ ]:
df['col2'].unique()

In [ ]:
df['col2'].value_counts()

In [ ]:
df[df['col1']>2]

In [ ]:
def times2(x):
    return x*2

In [ ]:
df[['col1','col2']].apply(times2)

In [ ]:
df[['col1','col2']].apply(lambda x: x*2)

In [ ]:
df.drop(0)

In [ ]:
df.drop('col2',axis=1,inplace = True)

In [ ]:
df

# Data input and output

## csv excel html sql

In [ ]:
conda install sqlalchemy
conda install lxml
conda install html5lib
conda install BeautifulSoup4

In [ ]:
df

In [ ]:
df.to_excel('example.xlsx',sheet_name="first")

In [132]:
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [138]:
data[0].head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
1,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
2,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
3,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539
4,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538

In [142]:
from sqlalchemy import create_engine
import pandas as pd

In [143]:
engine = create_engine('sqlite:///:memory:')

In [147]:
df.to_sql('my_table',engine)

6

In [151]:
sqlpdf=pd.read_sql('my_table',con=engine)

In [149]:
sqlpdf

   index Company    Person  Sales
0      0    GOOG       Sam    200
1      1    GOOG   Charlie    120
2      2    MSFT       Amy    340
3      3    MSFT  Vasnessa    124
4      4      FB      Carl    243
5      5      FB     Sarah    350